## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/b269bcb6-2b6e-43ce-9041-69f4c5ab9124).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.atlas_schema.terrateam will be read during apply
  # (config refers to values not yet known)
 <= data "atlas_schema" "terrateam" {
+       dev_url = (sensitive value)
+       hcl     = (known after apply)
+       id      = (known after apply)
+       src     = <<-EOT
            table "users" {
              schema = schema.terrateam
              column "id" {
                type = char(36)
                null = false
              }
              column "name" {
                type = character_varying(32)
                null = false
              }
              column "is_admin" {
                type = boolean
                null = false
              }
              primary_key {
                columns = [column.id]
              }
            }
            schema "terrateam" {
            }
        EOT
    }

  # atlas_schema.terrateam will be created
+   resource "atlas_schema" "terrateam" {
+       hcl = (known after apply)
+       id  = (known after apply)
+       url = (sensitive value)
    }

  # aws_db_instance.terrateam must be replaced
-/+ resource "aws_db_instance" "terrateam" {
!       address                               = "terrateam.c3gmg4ewaocx.eu-west-1.rds.amazonaws.com" -> (known after apply)
!       arn                                   = "arn:aws:rds:eu-west-1:***:db:terrateam" -> (known after apply)
!       availability_zone                     = "eu-west-1b" -> (known after apply)
!       backup_retention_period               = 0 -> (known after apply)
!       backup_target                         = "region" -> (known after apply)
!       backup_window                         = "04:17-04:47" -> (known after apply)
!       ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
+       character_set_name                    = (known after apply)
-       customer_owned_ip_enabled             = false -> null
!       database_insights_mode                = "standard" -> (known after apply)
+       db_name                               = (known after apply)
-       deletion_protection                   = false -> null
-       domain_dns_ips                        = [] -> null
+       domain_fqdn                           = (known after apply)
-       enabled_cloudwatch_logs_exports       = [] -> null
!       endpoint                              = "terrateam.c3gmg4ewaocx.eu-west-1.rds.amazonaws.com:5432" -> (known after apply)
!       engine                                = "postgres" -> "mysql" # forces replacement
!       engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
!       engine_version                        = "17.2" -> "8.0"
!       engine_version_actual                 = "17.2" -> (known after apply)
!       hosted_zone_id                        = "Z29XKXDKYMONMX" -> (known after apply)
-       iam_database_authentication_enabled   = false -> null
!       id                                    = "db-CHAKJGPJPVNNY6VMU3Z6GWME7E" -> (known after apply)
+       identifier_prefix                     = (known after apply)
!       iops                                  = 0 -> (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
!       license_model                         = "postgresql-license" -> (known after apply)
!       listener_endpoint                     = [] -> (known after apply)
!       maintenance_window                    = "tue:03:46-tue:04:16" -> (known after apply)
!       master_user_secret                    = [] -> (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
-       max_allocated_storage                 = 0 -> null
+       monitoring_role_arn                   = (known after apply)
!       multi_az                              = false -> (known after apply)
+       nchar_character_set_name              = (known after apply)
!       network_type                          = "IPV4" -> (known after apply)
!       option_group_name                     = "default:postgres-17" -> (known after apply)
!       parameter_group_name                  = "default.postgres17" -> "default.mysql8.0"
+       performance_insights_kms_key_id       = (known after apply)
!       performance_insights_retention_period = 0 -> (known after apply)
!       port                                  = 5432 -> (known after apply)
+       replica_mode                          = (known after apply)
!       replicas                              = [] -> (known after apply)
!       resource_id                           = "db-CHAKJGPJPVNNY6VMU3Z6GWME7E" -> (known after apply)
+       snapshot_identifier                   = (known after apply)
!       status                                = "available" -> (known after apply)
-       storage_encrypted                     = false -> null
!       storage_throughput                    = 0 -> (known after apply)
-       tags                                  = {} -> null
!       tags_all                              = {} -> (known after apply)
+       timezone                              = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_security_group.rds will be updated in-place
!   resource "aws_security_group" "rds" {
!       egress                 = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               from_port        = 5432
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 5432
                # (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        id                     = "sg-091f358403d80e0ae"
!       ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               from_port        = 5432
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 5432
                # (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "terrateam"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: -2.10 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 15.87 | 13.78 | -2.10|
| | **Total** | **15.87** | **13.78** | **-2.10** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
